spec/fixtures/cassettes/BookingSync_API_Client_Payments/_edit_payment/updates_given_payment_by_ID.yml

---
http_interactions:
- request:
    method: put
    uri: https://www.bookingsync.com/api/v3/payments/268621
    body:
      encoding: UTF-8
      string: '{"payments":[{"kind":"cheque"}]}'
    headers:
      User-Agent:
      - BookingSync API gem v0.1.3
      Accept:
      - application/vnd.api+json
      Content-Type:
      - application/vnd.api+json
      Authorization:
      - Bearer <<ACCESS_TOKEN>>
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 08 Dec 2016 18:20:23 GMT
      Content-Type:
      - application/vnd.api+json; charset=utf-8
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Status:
      - 200 OK
      X-Frame-Options:
      - SAMEORIGIN
      X-Xss-Protection:
      - 1; mode=block
      X-Content-Type-Options:
      - nosniff
      X-Updated-Since-Request-Synced-At:
      - 2016-12-08 18:20:23 UTC
      X-Ratelimit-Limit:
      - '1000'
      X-Ratelimit-Reset:
      - '1481223600'
      X-Ratelimit-Remaining:
      - '983'
      Etag:
      - W/"33734b956e5f06a4f612f7d9eee296a6"
      Cache-Control:
      - max-age=0, private, must-revalidate
      P3p:
      - CP="OTI DSP COR CUR ADMo DEVo TAI PSAi PSDi IVAi IVDi CONi HISi TELi OTPi
        OUR SAMi OTRo UNRo PUBi IND UNI STA"
      Set-Cookie:
      - ahoy_track=true; path=/; secure
      - ahoy_visit=77f74163-53f9-48d9-a261-ad65768c57a4; path=/; expires=Thu, 15 Dec
        2016 18:20:23 -0000; secure
      - ahoy_visitor=9c0334ff-8128-45a1-9e6a-722157141d59; path=/; expires=Sat, 08
        Dec 2018 18:20:23 -0000; secure
      X-Request-Id:
      - e6eeeaba-b297-4f8c-9942-c248c472cd92
      X-Runtime:
      - '0.128422'
      Strict-Transport-Security:
      - max-age=31536000
    body:
      encoding: UTF-8
      string: '{"links":{"payments.account":"https://www.bookingsync.com/api/v3/accounts/{payments.account}","payments.payment_gateway":"https://www.bookingsync.com/api/v3/payment_gateways/{payments.payment_gateway}","payments.bookings":"https://www.bookingsync.com/api/v3/bookings/{payments.bookings}","payments.bookings_payments":"https://www.bookingsync.com/api/v3/bookings_payments/{payments.bookings_payments}"},"payments":[{"links":{"account":3837,"payment_gateway":null,"bookings":[817604],"bookings_payments":[268654]},"id":268621,"transaction_id":null,"order_id":null,"card":null,"amount_in_cents":200,"currency":"EUR","kind":"cheque","fullname":"John
        Smith","email":"smith@example.com","address1":null,"address2":null,"zip":null,"city":null,"state":null,"country_code":null,"locale":null,"ip":null,"test":false,"notes":null,"paid_at":"2016-12-06T11:34:05Z","created_at":"2016-12-08T18:19:46Z","updated_at":"2016-12-08T18:20:23Z","rejected_at":null,"canceled_at":null,"description":""}]}'
    http_version: 
  recorded_at: Thu, 08 Dec 2016 18:20:23 GMT
recorded_with: VCR 3.0.3
